---
kind: enumMember
id: F:Autodesk.Revit.DB.SubfaceType.Top
enum: Autodesk.Revit.DB.SubfaceType
source: html/20b2a2c2-53b4-caab-ce4c-aec68a2aa084.htm
---
# Autodesk.Revit.DB.SubfaceType.Top

A horizontal top face of the room as defined by the room's level and height, or a face of the
 room that is bounded above by a room-bounding element.